In [8]:
import pandas as pd
from sklearn.linear_model import LinearRegression

In [9]:
df = pd.read_csv('train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [10]:
print(df['Age'].isnull().sum())

177

In [11]:
#xu ly dac trung gioi tinh (Sex)
df_processed = pd.get_dummies(df, columns=['Sex'], drop_first=True)
df_processed.head()

   PassengerId  Survived  Pclass  ... Cabin  Embarked  Sex_male
0            1         0       3  ...   NaN         S      True
1            2         1       1  ...   C85         C     False
2            3         1       3  ...   NaN         S     False
3            4         1       1  ...  C123         S     False
4            5         0       3  ...   NaN         S      True

[5 rows x 12 columns]

In [12]:
features = ['Pclass', 'SibSp', 'Parch', 'Sex_male']
target = 'Age'

In [13]:
data_with_age = df_processed.dropna(subset=['Age'])
data_without_age = df_processed[df_processed['Age'].isnull()]

x_train = data_with_age[features]
y_train = data_with_age[target]

In [ ]:
X_pridict = data_without_age[features]

if X_pridict.empty:
    print("No data to predict")
else:
    model = LinearRegression()
    model.fit(x_train, y_train)
    predicted_ages = model.predict(X_pridict[features])
    indices_to_fill = df[df['Age'].isnull()].index
    df.loc[indices_to_fill, 'Age'] = predicted_ages

In [20]:
df.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]